{
  "backend/main.mo": "Main backend actor implementing Minecraft server hosting platform with user profiles, hosting plans, server management, plugin system, Stripe payments, and role-based access control using Internet Identity authentication.",
  "feature_evidence.json": "Feature evidence report documenting three related features for fixing server creation button issues, debugging form submission logic, and adding loading/error states to improve user feedback during server provisioning.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration, highlighting the fixed server provisioning flow in UserDashboard that prevents redirect loops.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark themes with gaming-focused dark aesthetic featuring deep blacks and vibrant accents.",
  "frontend/index.html": "HTML entry point for the Doom Hosting application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all routes, ThemeProvider for dark mode, Toaster for notifications, and ProfileSetupModal for first-time user onboarding.",
  "frontend/src/components/AccessDenied.tsx": "Access denied page component displaying shield alert icon and return-to-home button for users attempting to access unauthorized admin features.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper providing sticky header with logo, navigation links (servers, plugins, admin), login button, and footer with Caffeine attribution.",
  "frontend/src/components/LoginButton.tsx": "Internet Identity authentication button handling login/logout with loading states, error recovery for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/PricingPlans.tsx": "Displays a grid of hosting plan cards with pricing, specs (RAM, FPS), and features, allowing authenticated users to select a plan and navigate to the dashboard.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup, collecting name and email with form validation and submission via useSaveCallerUserProfile hook.",
  "frontend/src/components/ServerCard.tsx": "Card component displaying a Minecraft server's status, plan details, and specs with a manage button that navigates to the server detail page.",
  "frontend/src/components/StripeSetup.tsx": "Admin dialog for configuring Stripe payment integration by entering secret key and allowed country codes.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend API calls including user profiles, admin checks, hosting plans, server management, plugins, payments, and Stripe configuration.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (light and dark modes), including colors for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page displaying statistics (servers, users, Stripe status) and tabbed interface for managing servers, users, and settings. Includes access control and Stripe setup modal.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page with hero section, feature highlights (instant setup, plugin support, security), and pricing plans. Adapts CTA based on authentication status.",
  "frontend/src/pages/PaymentFailure.tsx": "Payment failure page displaying error message with options to retry payment or return to dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Payment success page that verifies Stripe session status and automatically creates a server based on the selected plan after successful payment.",
  "frontend/src/pages/PluginLibrary.tsx": "Plugin library page displaying available Minecraft plugins in a grid layout with name, version, and description. Requires authentication.",
  "frontend/src/pages/ServerDetails.tsx": "Server details page showing server specifications (RAM, FPS, domain), installed plugins with removal capability, and available plugins for installation.",
  "frontend/src/pages/UserDashboard.tsx": "User dashboard page that displays user's Minecraft servers and handles server creation flow, including free plan creation and Stripe checkout redirection for paid plans based on URL query parameters.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, typography, animations, and design tokens for the UI component system.",
  "project_state.json": "Project metadata tracking the Doom Hosting Minecraft server platform's features, architecture (Stripe payments, automated provisioning, plugin system), known issues, and implementation status across six main feature areas."
}